           MOVE  FUNCTION CURRENT-DATE TO   WS-SYS-DATE.
           MOVE  WS-SYS-MO             TO   WS-FMTD-MO.
           MOVE  WS-SYS-DAY            TO   WS-FMTD-DAY.
           MOVE  WS-SYS-YR             TO   WS-FMTD-YR.
           MOVE  WS-SYS-HR             TO   WS-FMTD-HR.
           MOVE  WS-SYS-MIN            TO   WS-FMTD-MIN.
